{
  "companies": [
    {
      "id": "upwork",
      "company": "Upwork",
      "initialText": "CRITICAL - EVALUATE THE JOB FIRST:\nBefore creating the proposal, analyze if this job is worth applying to. Check for RED FLAGS:\n- Budget too low for the scope of work (less than $500 for complex projects)\n- Vague requirements or unclear deliverables\n- Client has no payment history or poor reviews\n- Unrealistic timeline expectations\n- Job description shows signs of being a scam or time-waster\n- Skills required don't match my expertise well (less than 60% match)\n- Fixed-price job with scope creep potential\n- Client requesting work before hiring\n\nIf you find 2 or more red flags, STOP and respond with:\n\"⚠️ NO RECOMIENDO APLICAR A ESTE TRABAJO\n\nRazones:\n[List specific red flags found]\n\nRecomendación: [Brief advice on what type of jobs to focus on instead]\"\n\nIf the job looks promising, proceed with the proposal.\n\n---\n\nCREATE A WINNING UPWORK PROPOSAL:\n\nFIRST 2 LINES ARE CRITICAL - They determine if the client keeps reading:\n\nLINE 1: Start with a relevant emoji + mention ONE specific detail from their project description + state a concrete result you can deliver.\nExample format: \"🎯 I see you need [specific thing from their job post] - I can deliver [concrete outcome] in [timeframe].\"\n\nLINE 2: State the direct benefit for THEM (not about you).\nExample format: \"This means [specific benefit like 'you'll save 10 hours/week' or 'your users will see 50% faster load times'].\"\n\nREQUIREMENTS:\n- NO generic openings like \"As a seasoned professional\" or \"I am excited to apply\"\n- NO talking about yourself in the first 2 lines\n- Show you READ their job post by referencing specific details\n- Be concrete with numbers, timeframes, or measurable outcomes\n- Use Mathematical Bold Unicode for emphasis on key terms\n- Keep it conversational and direct\n- Plain text format only (no markdown or HTML)\n\nAFTER THE OPENING:\n- Keep total proposal under 200 words (clients don't read long proposals)\n- Focus on THEIR problem and YOUR solution\n- Include 1-2 relevant portfolio examples with specific results\n- End with a clear call-to-action\n- Avoid buzzwords and fluff"
    },
    {
      "id": "freelancer",
      "company": "Freelancer.com",
      "initialText": "Give me a cover letter for a job in Freelancer.com. \nMake something that catch the customer interest in the first two rows.\nDon't start using phrases like \"As a seazoned professional\" or \"I am excited to apply for this position\".\nEnsure the entire text uses plain text formatting so it can be copied without markdown or HTML.\nMake sure everything is in plain text without bold or any special characters.\nUse less than 1500 characters.\n"
    }
  ]
} 