{
  "profiles": [
    {
      "id": "enrique-montes",
      "name": "Enrique Montes",
      "profession": "Full-Stack Developer",
      "profileUrl": "https://www.upwork.com/freelancers/enriqueadelino",
      "skills": ["Next.js", "Gatsby.js", "React", "GoHighLevel", "JavaScript", "Typescript", "Tailwind CSS", "Strapi", "Node.js", "Git", "Github", "Wordpress", "Vercel", "Netlify"],
      "summary": "✅ Specialized Strapi developer | Expert in Strapi API development, custom plugins, and migrations (from WordPress and Contentful). I integrate Strapi with Next.js and automate workflows with n8n for content publishing, CRM sync, and internal tools.\n\nIs your Strapi or Next.js app slow, hard to maintain, or full of manual processes?\n\nI help startups and tech-driven teams build fast, scalable, and automated web applications.\n\nI’m Enrique Montes, a full-stack developer with 7 years of focused experience in Strapi and Next.js, now adding n8n to automate critical operations—content updates, notifications, data sync, CRM triggers, and more.\n\nI don’t just write code. I deliver production-ready apps that are:\n- Built for performance (SSR, SSG, ISR) and SEO (Core Web Vitals, dynamic metadata)\n- Easy to scale and maintain (clean architecture, CI/CD, Docker, AWS/Vercel)\n- Automated to reduce manual work\n\nMy focus: less technical debt, more business impact.\n\nResults:\n- 60% faster load times\n- 50% less time managing content\n- 70% fewer manual tasks with n8n automation\n\nIf you need a developer who acts like a technical partner—not just a coder—let’s talk.\n\n✉ Book a free 15-minute call to review your project and how I can help you ship faster and smarter.\n\n---\n\n⚙ Core services\n\n- Full-stack development: Strapi (backend) + Next.js (frontend)\n- Headless CMS migrations: WordPress, Contentful, or custom CMS → Strapi\n- Performance & SEO optimization: SSR/SSG, dynamic metadata, image optimization, Lighthouse 90+\n- Workflow automation: n8n for publishing, notifications, CRM sync, and internal tools\n- API development: REST & GraphQL, custom Strapi plugins, multi-tenancy, role-based access\n- DevOps & deployment: CI/CD, Docker, Vercel, Netlify, AWS, and monitoring\n\n---\n\n✅ Tech stack\n\n- CMS: Strapi (expert), Contentful, Sanity, WordPress (headless)\n- Frontend: Next.js, React, TypeScript, Tailwind CSS, SWR, React Query\n- Backend: Node.js, Express, GraphQL, PostgreSQL, MySQL\n- Automation: n8n (workflow design, API integrations, triggers)\n- DevOps: Vercel, Netlify, AWS, Docker, GitHub Actions, CI/CD pipelines\n- Testing: Jest, Cypress (basic E2E)\n\n---\n\n🏆 Client reviews\n\n\"Enrique gave me very professional and useful advice for my project — definitely at a senior level.\" — Client, Strapi Backend Review and Consultation (Aug 2025)\n\n\"Working with Enrique was an absolute pleasure! He demonstrated exceptional professionalism, timely communication, and a high level of expertise throughout the project. The quality of his work exceeded expectations, and he was quick to incorporate feedback and make improvements. I particularly appreciated his attention to detail and commitment to delivering a final product that aligned perfectly with our goals. I would highly recommend Enrique to anyone!\" — Client, Strapi Developer (Apr–Jul 2025)\n\n\"Enrique goes above and beyond. He's amazing to work with. His expertise and experience are very much evident when working with him. Highly recommended.\" — Client, GatsbyJS + Contentful Site Redesign (Nov 2023)\n\n\"We enjoyed working with Enrique, and after the initial project, he was extended to stay even longer and contribute to additional projects. Enrique brings a very positive and cooperative approach to his work. He was dependable and worked well with minimal guidance required — something that all Managers appreciate. He delivered a challenging upgrade for our Gatsby implementation (lots of tech debt to deal with) and then helped us with our CMS upgrade as well. Unfortunately, my budget for upgrades finally ran out and I had to end this contract, but will be keeping him in mind as future projects arrive.\" — Client, Gatsby/Strapi Site Development (Jan–Oct 2023)\n\n---\n\n✅ Why work with me?\n\n- Full-cycle developer: from idea to deployment and automation\n- Clean, documented code — easy for your team to maintain\n- Proactive communication — I flag risks early, propose options, and deliver on time\n- Flexible engagement: fractional, project-based, or ongoing support\n\nReady to build a web app that’s fast, maintainable, and automated? Let’s connect.",
      "portfolio": [
        {
          "title": "Peters – App Optimization & Enhancement",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1879728081945686016",
          "description": "I resolved critical issues with Gravity Forms data integration from WordPress, stabilizing the app's functionality. Subsequently, I made significant improvements to the overall application's performance using Gatsby.js and Netlify hosting. This project demonstrated my ability to enhance data handling and boost app efficiency.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Typescript", "Wordpress", "Node.js", "Git", "Github"]
        },
        {
          "title": "Bridge Artists – Website Maintenance & Data Modeling",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1772995277844119552",
          "description": "I was hired to fix existing errors on a Gatsby site using Contentful, hosted on Netlify. After resolving these issues, I took over site development, performing general app modifications, site maintenance, and data modeling, which enhanced API integration and overall site performance.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        },
        {
          "title": "Sustainable Luxury Fountain Pen - Next.js Tailwind CSS",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1773160204259106816",
          "description": "This was a truly beautiful project where I collaborated on the integration of Nextjs and the creation of some interactive animations using Tailwind CSS. It involved incorporating the Next.js React framework to build a modern, performant website with server-side rendering capabilities. Additionally, I utilized the utility-first Tailwind CSS library to craft sleek and responsive UI components. A key aspect was implementing eye-catching interactive animations through Tailwind's animation utilities, resulting in an engaging and visually appealing user experience.",
          "skills": ["Next.js", "React", "JavaScript", "Tailwind CSS", "Node.js", "Git", "Github", "Vercel"]
        },
        {
          "title": "Texas Ranches for Sale – Gatsby Website Development & Maintenance",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1720442791123886080",
          "description": "I developed and maintained a dynamic website for Texas Ranches for Sale using Gatsby, integrated with Sanity CRM for effective content management, and Algolia for powerful search functionality. This project required expertise in creating seamless user experiences and ensuring fast, efficient searches. The site enhancements boosted user engagement and streamlined content updates.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        },
        {
          "title": "MoneyGeek – Website Update & Full-Stack Development",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1720444465819652096",
          "description": "I enhanced the MoneyGeek platform by updating its website using Gatsby for a swift front end and Strapi for flexible content management. This project improved UI/UX design and optimized site performance. Subsequently, I expanded into full-stack development, adding new features and seamless third-party integrations. The result was a scalable, engaging site that increased user engagement and conversion rates.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Strapi", "Node.js", "Git", "Github", "Netlify", "GraphQL"]
        },
        {
          "title": "Osmocote - Gatsby Update from V2 to V5",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1879727247639900160",
          "description": "I addressed technical debt in an app integrating WordPress data with an outdated Gatsby version by upgrading it to the latest version. This update enhanced performance and compatibility. Subsequently, I conducted various developments across the app, improving functionality and user experience. Key skills utilized: Gatsby.js, GraphQL, React, WordPress as CMS, and Netlify hosting solutions, ensuring the app's robust operation and maintainability.",
          "skills": ["Next.js", "React", "JavaScript", "Strapi", "Node.js", "Git", "Github", "Tailwind CSS"]
        },
        {
          "title": "Multilingual Portfolio Website Built with Modern Web Technologies",
          "link": "https://enriquemontes.com",
          "description": "A personal portfolio crafted with Next.js, TypeScript, Tailwind CSS, and Strapi, showcasing my Full Stack Development skills. Available in 5 languages, with Spanish and English meticulously translated by me, while other languages leverage automated translation. This ensures precise communication and global accessibility for potential clients.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Wordpress", "Node.js", "Git", "Github", "GraphQL","Spanish Translation", "English Translation", "Full-Stack Development"]
        },
        {
          "title": "Frida Travel: Vacation Deals Platform for Mexican Destinations",
          "link": "https://frida-travel.netlify.app/en/",
          "description": "A dynamic travel website built with Gatsby.js and Contentful to provide seamless access to vacation deals in destinations like Mazatlán, Cozumel, and the Mayan Riviera. This project demonstrates expertise in creating fast, interactive, and visually appealing web applications with modern tools.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Contentful", "Node.js", "Git", "Github", "GraphQL","Full-Stack Development", "Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Mexico: Comprehensive Travel Guide to Mexico",
          "link": "https://www.turista.com.mx/",
          "description": "Developed using PHP and MySQL, Turista Mexico offers travelers an extensive guide to exploring Mexico's diverse destinations. This project showcases my ability to create robust, database-driven web applications that provide users with reliable and up-to-date travel information.",
          "skills": ["PHP", "MySQL", "Apache", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Estado de México: Explore the Wonders of the State of Mexico",
          "link": "https://edomexico.turista.com.mx/",
          "description": "A tourism website built with Gatsby, Tailwind CSS, Styled Components, and GraphQL, hosted on Netlify. It provides detailed information on top destinations, hotels, and events in the State of Mexico, helping visitors plan unforgettable trips with a fast and visually appealing user experience.",
          "skills": ["Gatsby.js", "Tailwind CSS", "GraphQL", "Netlify", "API Integration", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Chiapas: Your Gateway to the Beauty of Chiapas",
          "link": "https://chiapas.turista.com.mx/",
          "description": "A tourism website built with Gatsby, Tailwind CSS, Styled Components, and GraphQL, hosted on Netlify. Focused on Chiapas, it provides detailed information on breathtaking natural wonders like Sumidero Canyon and Palenque, along with hotels, events, and cultural highlights, helping visitors plan memorable trips to this stunning region.",
          "skills": ["Gatsby.js", "Tailwind CSS", "GraphQL", "Netlify", "API Integration", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "THoteles.com: Discover and Book Unique Stays (Available in Spanish)",
          "link": "https://thoteles.com",
          "description": "Built with WordPress, PHP, MySQL, and hosted on Nginx with Digital Ocean, THoteles.com is a Spanish-language platform that connects travelers with unique accommodations in the world’s most enchanting destinations. From vibrant city getaways to peaceful beach retreats, it offers a seamless experience to find and book the perfect stay.",
          "skills": ["Wordpress", "PHP", "MySQL", "NGINX", "Digital Ocean", "Full-Stack Development","Spanish Translation"]
        },
        {
          "title": "Gano Excel Cancun: Health and Wellness in Every Cup",
          "link": "https://ganocancun.com",
          "description": "Developed with Next.js, React, and Tailwind CSS, and hosted on Vercel, Gano Excel Cancun promotes health and wellness through its premium coffee products. The bilingual website (Spanish/English) provides a seamless user experience, connecting customers to the benefits of Ganoderma-infused beverages and enhancing their journey toward a healthier lifestyle.",
          "skills": ["Next.js", "React", "Tailwind CSS", "Vercel", "Full-Stack Development","Spanish Translation"]
        }
      ]
    },
    {
      "id": "enrique-montes-2",
      "name": "Enrique Montes Araujo",
      "profession": "Web Developer",
      "profileUrl": "https://www.upwork.com/freelancers/enriqueadelino",
      "skills": ["Web Development", "Full-Stack Developer", "Front-end Developer", "Back-end Developer", "Web Application"],
      "summary": "I'm Enrique Montes, a Full-Stack Developer with 30+ years in IT and 5+ years of focused experience using React, Next.js, and Gatsby...",
      "portfolio": [
        {
          "title": "Peters – App Optimization & Enhancement",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1879728081945686016",
          "description": "I resolved critical issues with Gravity Forms data integration from WordPress, stabilizing the app's functionality...",
          "skills": ["Gatsby.js", "React", "JavaScript", "Typescript", "Wordpress", "Node.js", "Git", "Github"]
        },
        {
          "title": "Bridge Artists – Website Maintenance & Data Modeling",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1772995277844119552",
          "description": "I was hired to fix existing errors on a Gatsby site using Contentful, hosted on Netlify...",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        }
      ]
    }
  ]
}
