{
  "profiles": [
    {
      "id": "enrique-montes",
      "name": "Enrique Montes",
      "profession": "Full-Stack Developer",
      "profileUrl": "https://www.upwork.com/freelancers/enriqueadelino",
      "skills": ["Next.js", "Gatsby.js", "React", "GoHighLevel", "JavaScript", "Typescript", "Tailwind CSS", "Strapi", "Node.js", "Git", "Github", "Wordpress", "Vercel", "Netlify"],
      "summary": "Tired of manual, repetitive tasks? Need to connect your Strapi CMS, Next.js app, and third-party tools (like Slack or a CRM) into one seamless workflow?\n\nI'm Enrique Montes, a senior Full-Stack Developer with 30+ years of IT experience, specializing in **n8n Workflow Automation**. My expertise is building robust, scalable automations that save you time, reduce errors, and streamline your business.\n\n**Why choose me?** I am not just an automation specialist; I am a senior developer. Unlike freelancers who only use no-code UIs, my deep expertise in Strapi (expert), Next.js, and Node.js means I can build the complete solution. If the API endpoint you need doesn't exist, I will build it. If your workflow requires custom logic, I will code it.\n\n**My focus:** Less manual work, more business impact.\n\n✅ **70%+ reduction in manual tasks with n8n automation.**\n✅ **Seamless API integrations (Slack, CRMs, Headless CMS).**\n✅ **Full-stack solutions:** I build both the application (Strapi/Next.js) and the automation that powers it.\n\nIf you need a true technical partner to solve complex integration challenges, let's talk.\n\n📩 **Book a free 15-minute call** to review your project and identify your biggest automation opportunities.\n\n**🔧 CORE SERVICES**\n- **n8n Workflow Automation:** Design, development, and maintenance of complex automated workflows. Custom n8n node creation, error handling, and optimization.\n- **API Development & Integration:** The 'glue' for your systems. I build and connect REST & GraphQL APIs for Strapi, CRMs (FollowUpBoss, etc.), Slack, and any third-party service.\n- **Strapi CMS & Next.js Development:** Building the high-performance headless CMS and frontend applications that your automations will power.\n- **Slack Integration:** Custom bots, slash commands, and automated notifications to streamline your team's communication and connect it to your business data.\n\n**💻 TECH STACK**\n- **Automation:** n8n (Expert)\n- **Backend & APIs:** Strapi (Expert), Node.js, Supabase, GraphQL, REST\n- **Frontend:** Next.js, React, TypeScript, Tailwind CSS\n- **Communication:** Slack (API, Bots, Webhooks), Discord, SendGrid\n- **Databases:** PostgreSQL, MySQL\n- **DevOps:** Vercel, Netlify, AWS, CI/CD\n\n**⭐ CLIENT REVIEWS**\n- *Working with Enrique was an absolute pleasure! He demonstrated exceptional professionalism, timely communication, and a high level of expertise throughout the project. The quality of his work exceeded expectations, and he was quick to incorporate feedback and make improvements.* — Client, Strapi Developer (Apr - Jul 2025)\n- *Enrique goes above and beyond. He's amazing to work with. His expertise and experience are very much evident when working with him. Highly recommended.* — Client, GatsbyJS + Contentful Site Redesign (Nov 2023)\n- *We enjoyed working with Enrique... he was extended to stay even longer and contribute to additional projects. Enrique brings a very positive and cooperative approach to his work. He was dependable and worked well with minimal guidance required... He delivered a challenging upgrade for our Gatsby implementation...* — Client, Gatsby/Strapi Site Development (Jan - Oct 2023)\n\n**🚀 WHY WORK WITH ME?**\n- **Developer-Led Automation:** I don't just connect apps. I understand the full stack (database, API, frontend) and can build the custom code required for automations that no-code-only specialists can't handle.\n- **Strapi & Next.js Expert:** Deep, proven knowledge of the stack you are likely using, ensuring seamless and efficient integration.\n- **30+ Years Experience:** You get a senior-level partner who provides proactive communication, clean code, and solutions that are built to scale.\n- **Business-Focused:** I translate your business problems into efficient, automated solutions that save you time and money.\n\nReady to automate your business-critical processes? **📩 Send me a message now to schedule your free 15-minute strategy call.**",
      "portfolio": [
        {
          "title": "Peters – App Optimization & Enhancement",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1879728081945686016",
          "description": "I resolved critical issues with Gravity Forms data integration from WordPress, stabilizing the app's functionality. Subsequently, I made significant improvements to the overall application's performance using Gatsby.js and Netlify hosting. This project demonstrated my ability to enhance data handling and boost app efficiency.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Typescript", "Wordpress", "Node.js", "Git", "Github"]
        },
        {
          "title": "Bridge Artists – Website Maintenance & Data Modeling",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1772995277844119552",
          "description": "I was hired to fix existing errors on a Gatsby site using Contentful, hosted on Netlify. After resolving these issues, I took over site development, performing general app modifications, site maintenance, and data modeling, which enhanced API integration and overall site performance.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        },
        {
          "title": "Sustainable Luxury Fountain Pen - Next.js Tailwind CSS",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1773160204259106816",
          "description": "This was a truly beautiful project where I collaborated on the integration of Nextjs and the creation of some interactive animations using Tailwind CSS. It involved incorporating the Next.js React framework to build a modern, performant website with server-side rendering capabilities. Additionally, I utilized the utility-first Tailwind CSS library to craft sleek and responsive UI components. A key aspect was implementing eye-catching interactive animations through Tailwind's animation utilities, resulting in an engaging and visually appealing user experience.",
          "skills": ["Next.js", "React", "JavaScript", "Tailwind CSS", "Node.js", "Git", "Github", "Vercel"]
        },
        {
          "title": "Texas Ranches for Sale – Gatsby Website Development & Maintenance",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1720442791123886080",
          "description": "I developed and maintained a dynamic website for Texas Ranches for Sale using Gatsby, integrated with Sanity CRM for effective content management, and Algolia for powerful search functionality. This project required expertise in creating seamless user experiences and ensuring fast, efficient searches. The site enhancements boosted user engagement and streamlined content updates.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        },
        {
          "title": "MoneyGeek – Website Update & Full-Stack Development",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1720444465819652096",
          "description": "I enhanced the MoneyGeek platform by updating its website using Gatsby for a swift front end and Strapi for flexible content management. This project improved UI/UX design and optimized site performance. Subsequently, I expanded into full-stack development, adding new features and seamless third-party integrations. The result was a scalable, engaging site that increased user engagement and conversion rates.",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Strapi", "Node.js", "Git", "Github", "Netlify", "GraphQL"]
        },
        {
          "title": "Osmocote - Gatsby Update from V2 to V5",
          "link": "https://www.upwork.com/fl/~011b1de3cb73e46439?p=1879727247639900160",
          "description": "I addressed technical debt in an app integrating WordPress data with an outdated Gatsby version by upgrading it to the latest version. This update enhanced performance and compatibility. Subsequently, I conducted various developments across the app, improving functionality and user experience. Key skills utilized: Gatsby.js, GraphQL, React, WordPress as CMS, and Netlify hosting solutions, ensuring the app's robust operation and maintainability.",
          "skills": ["Next.js", "React", "JavaScript", "Strapi", "Node.js", "Git", "Github", "Tailwind CSS"]
        },
        {
          "title": "Multilingual Portfolio Website Built with Modern Web Technologies",
          "link": "https://enriquemontes.com",
          "description": "A personal portfolio crafted with Next.js, TypeScript, Tailwind CSS, and Strapi, showcasing my Full Stack Development skills. Available in 5 languages, with Spanish and English meticulously translated by me, while other languages leverage automated translation. This ensures precise communication and global accessibility for potential clients.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Wordpress", "Node.js", "Git", "Github", "GraphQL","Spanish Translation", "English Translation", "Full-Stack Development"]
        },
        {
          "title": "Frida Travel: Vacation Deals Platform for Mexican Destinations",
          "link": "https://frida-travel.netlify.app/en/",
          "description": "A dynamic travel website built with Gatsby.js and Contentful to provide seamless access to vacation deals in destinations like Mazatlán, Cozumel, and the Mayan Riviera. This project demonstrates expertise in creating fast, interactive, and visually appealing web applications with modern tools.",
          "skills": ["Gatsby.js", "React", "JavaScript", "Contentful", "Node.js", "Git", "Github", "GraphQL","Full-Stack Development", "Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Mexico: Comprehensive Travel Guide to Mexico",
          "link": "https://www.turista.com.mx/",
          "description": "Developed using PHP and MySQL, Turista Mexico offers travelers an extensive guide to exploring Mexico's diverse destinations. This project showcases my ability to create robust, database-driven web applications that provide users with reliable and up-to-date travel information.",
          "skills": ["PHP", "MySQL", "Apache", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Estado de México: Explore the Wonders of the State of Mexico",
          "link": "https://edomexico.turista.com.mx/",
          "description": "A tourism website built with Gatsby, Tailwind CSS, Styled Components, and GraphQL, hosted on Netlify. It provides detailed information on top destinations, hotels, and events in the State of Mexico, helping visitors plan unforgettable trips with a fast and visually appealing user experience.",
          "skills": ["Gatsby.js", "Tailwind CSS", "GraphQL", "Netlify", "API Integration", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "Turista Chiapas: Your Gateway to the Beauty of Chiapas",
          "link": "https://chiapas.turista.com.mx/",
          "description": "A tourism website built with Gatsby, Tailwind CSS, Styled Components, and GraphQL, hosted on Netlify. Focused on Chiapas, it provides detailed information on breathtaking natural wonders like Sumidero Canyon and Palenque, along with hotels, events, and cultural highlights, helping visitors plan memorable trips to this stunning region.",
          "skills": ["Gatsby.js", "Tailwind CSS", "GraphQL", "Netlify", "API Integration", "Full-Stack Development","Spanish Translation", "English Translation"]
        },
        {
          "title": "THoteles.com: Discover and Book Unique Stays (Available in Spanish)",
          "link": "https://thoteles.com",
          "description": "Built with WordPress, PHP, MySQL, and hosted on Nginx with Digital Ocean, THoteles.com is a Spanish-language platform that connects travelers with unique accommodations in the world’s most enchanting destinations. From vibrant city getaways to peaceful beach retreats, it offers a seamless experience to find and book the perfect stay.",
          "skills": ["Wordpress", "PHP", "MySQL", "NGINX", "Digital Ocean", "Full-Stack Development","Spanish Translation"]
        },
        {
          "title": "Gano Excel Cancun: Health and Wellness in Every Cup",
          "link": "https://ganocancun.com",
          "description": "Developed with Next.js, React, and Tailwind CSS, and hosted on Vercel, Gano Excel Cancun promotes health and wellness through its premium coffee products. The bilingual website (Spanish/English) provides a seamless user experience, connecting customers to the benefits of Ganoderma-infused beverages and enhancing their journey toward a healthier lifestyle.",
          "skills": ["Next.js", "React", "Tailwind CSS", "Vercel", "Full-Stack Development","Spanish Translation"]
        }
      ]
    },
    {
      "id": "enrique-montes-2",
      "name": "Enrique Montes Araujo",
      "profession": "Web Developer",
      "profileUrl": "https://www.upwork.com/freelancers/enriqueadelino",
      "skills": ["Web Development", "Full-Stack Developer", "Front-end Developer", "Back-end Developer", "Web Application"],
      "summary": "I'm Enrique Montes, a Full-Stack Developer with 30+ years in IT and 5+ years of focused experience using React, Next.js, and Gatsby...",
      "portfolio": [
        {
          "title": "Peters – App Optimization & Enhancement",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1879728081945686016",
          "description": "I resolved critical issues with Gravity Forms data integration from WordPress, stabilizing the app's functionality...",
          "skills": ["Gatsby.js", "React", "JavaScript", "Typescript", "Wordpress", "Node.js", "Git", "Github"]
        },
        {
          "title": "Bridge Artists – Website Maintenance & Data Modeling",
          "link": "https://www.upwork.com/freelancers/enriqueadelino?p=1772995277844119552",
          "description": "I was hired to fix existing errors on a Gatsby site using Contentful, hosted on Netlify...",
          "skills": ["Gatsby.js", "React", "JavaScript", "API Integration", "Sanity", "Node.js", "Git", "Github", "Netlify"]
        }
      ]
    }
  ]
}
